import datetime

DESCRIPTION_COLUMN_SCHEDULE = [
    "Эксперимент",
    "Объект",
    "SN \nрегистратора",
    "Модель \nрегистратора",
    "Начало \nэксперимента",
    "Статус",
    "Интервал \nповторения записи",
    "Длительность\n записи",
    "Общая \nдлительность",
    "Всего \nзаписей",
    "Неудачных записей",
    "Формат",
    "Частота"
]

EXAMPLE_DATA_SCHEDULE = [
    [
        "Эксперимент-X", "Mouse-1", "0001",
        "InRat", datetime.datetime.now(), "Идёт запись ЭКГ",
        "1 час", "30 минут", "3 часа", "2", "0", "EDF", "1000 Гц"
    ],
    [
        "Эксперимент-X", "Mouse-2", "0002",
        "InRat", datetime.datetime.now() + datetime.timedelta(hours=24), "До начала записи 1 день",
        "1 час", "10 минут", "0", "0", "0", "EDF", "500 Гц"
    ]
]

# old: ["№", "Имя объекта", "Серийный номер", "Частота", "Формат", "Длительность", "Интервал",]

DESCRIPTION_COLUMN_HISTORY = [
    "№",
    "Эксперимент",
    "Объект",
    "Дата записи",
    "Начало записи",
    "Длительность",
    "Статус"
]

EXAMPLE_DATA_HISTORY = [
    ["1", "Эксперимент-X", "Mouse-1", datetime.datetime.now(), datetime.datetime.now(), "30 минут", "Завершено"],
    ["2", "Эксперимент-X", "Mouse-1", datetime.datetime.now(), datetime.datetime.now(), "30 минут", "Идёт запись"],
    ["3", "Эксперимент-X", "Mouse-1", datetime.datetime.now(), datetime.datetime.now(), "30 минут", "Завершено"],
]